{
  "preRequisites:11": [
    1
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "This is your first day and the first thing you should do is use your fist to break some wood\n\nWood is a structural tissue found in the stems and roots of trees and other woody plants. It is an organic material – a natural composite of cellulose fibers that are strong in tension and embedded in a matrix of lignin that resists compression. Wood is sometimes defined as only the secondary xylem in the stems of trees,[1] or it is defined more broadly to include the same type of tissue elsewhere such as in the roots of trees or shrubs.[citation needed] In a living tree it performs a support function, enabling woody plants to grow large or to stand up by themselves. It also conveys water and nutrients between the leaves, other growing tissues, and the roots. Wood may also refer to other plant materials with comparable properties, and to material engineered from wood, or woodchips or fiber.\n\nWood has been used for thousands of years for fuel, as a construction material, for making tools and weapons, furniture and paper. More recently it emerged as a feedstock for the production of purified cellulose and its derivatives, such as cellophane and cellulose acetate. ",
      "icon:10": {
        "Count:3": 1,
        "id:8": "minecraft:log"
      },
      "name:8": "Breaking Logs"
    }
  },
  "questID:3": 0,
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 16,
          "id:8": "minecraft:planks"
        },
        "1:10": {
          "Count:3": 4,
          "id:8": "minecraft:log"
        }
      },
      "index:3": 0,
      "rewardID:8": "bq_standard:choice"
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 1,
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "OreDict:8": "logWood",
          "id:8": "minecraft:log"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}